artillery/cpsu_load_test.yml
config:
  processor: "./cpsu_entrypoint.mjs"
  plugins:
    expect: {}
    apdex: {}
  phases:
    - name: ramp up phase
      duration: "{{ $env.rampUpDuration }}"
      arrivalRate: 1
      rampTo: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
    - name: run phase
      duration: "{{ $env.duration }}"
      arrivalRate: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk/
    ref:
      target: https://ref.api.service.nhs.uk/
    int:
      target: https://int.api.service.nhs.uk/
    pr:
      target: https://psu-pr-{{ $env.prNumber }}.dev.eps.national.nhs.uk/

before:
  flow:
    - function: "getSharedAuthToken"

scenarios:
  - name: "call cpsu - successful"
    weight: 90
    tags:
      isValid: true
    beforeRequest: "getCPSUParams"
    flow:
      - function: "getSharedAuthToken"
      - post:
          url: "/custom-prescription-status-update/format-1"
          headers:
            apiKey: "{{ apiKey }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 201

  - name: "call cpsu - unsuccessful"
    weight: 10
    tags:
      isValid: false
    beforeRequest: "getCPSUParams"
    flow:
      - function: "getSharedAuthToken"
      - post:
          url: "/custom-prescription-status-update/format-1"
          headers:
            apikey: "{{ apiKey }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 400