artillery/cpsu_load_test.yml
config:
  processor: "./cpsu_entrypoint.mjs"
  plugins:
    expect: {}
    apdex: {}
  phases:
    - name: ramp up phase
      duration: "{{ $env.rampUpDuration }}"
      arrivalRate: 1
      rampTo: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
    - name: run phase
      duration: "{{ $env.duration }}"
      arrivalRate: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk/
    ref:
      target: https://ref.api.service.nhs.uk/

before:
  flow:
    - function: "getSharedAuthToken"

scenarios:
  - name: "call cpsu"
    beforeRequest: "getCPSUParams"
    flow:
      - function: "getSharedAuthToken"
      - post:
          url: "/custom-prescription-status-update/format-1/"
          headers:
            # TODO: I'm pretty sure the existing API token will not have CPSU access.
            # If the load testing fails, this should be the first place we look for the cause
            Authorization: "Bearer {{ authToken }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 201