artillery/notify_load_test.yml
config:
  processor: "./notify_entrypoint.mjs"
  plugins:
    expect: {}
    apdex: {}
  phases:
    - name: ramp up phase
      duration: "{{ $env.rampUpDuration }}"
      arrivalRate: 1
      rampTo: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
    - name: run phase
      duration: "{{ $env.duration }}"
      arrivalRate: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk/
    ref:
      target: https://ref.api.service.nhs.uk/
    int:
      target: https://int.api.service.nhs.uk/
    pr:
      target: https://psu-pr-{{ prNumber }}.dev.eps.national.nhs.uk/

before:
  flow:
    - function: getSharedAuthToken

scenarios:
  - name: Allowed ODS code scenario
    weight: 1
    flow:
      - function: initUserAllowed
      - loop:
          - function: getSharedAuthToken
          - post:
              url: "/prescription-status-update/"
              beforeRequest: "generatePrescData"
              headers:
                Authorization: "Bearer {{ authToken }}"
                x-request-id:     "{{ x_request_id }}"
                x-correlation-id: "{{ x_correlation_id }}"
              expect:
                - statusCode: 201
          - think: "{{ nextDelay }}seconds"
        count: "{{ prescriptionCount }}"

  - name: Blocked ODS code scenario
    weight: 3
    flow:
      - function: initUserBlocked
      - loop:
          - function: getSharedAuthToken
          - post:
              url: "/prescription-status-update/"
              beforeRequest: "generatePrescData"
              headers:
                Authorization: "Bearer {{ authToken }}"
                x-request-id:     "{{ x_request_id }}"
                x-correlation-id: "{{ x_correlation_id }}"
              expect:
                - statusCode: 201
          - think: "{{ nextDelay }}seconds"
        count: "{{ prescriptionCount }}"