artillery/notify_load_test.yml
config:
  processor: "./notify_entrypoint.mjs"
  plugins:
    expect: {}
    apdex: {}
  phases:
    - name: run phase
      duration: "{{ $env.duration }}"
      arrivalRate: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk/
    ref:
      target: https://ref.api.service.nhs.uk/
    int:
      target: https://int.api.service.nhs.uk/
    pr:
      target: https://psu-pr-{{ prNumber }}.dev.eps.national.nhs.uk/

before:
  flow:
    - function: getSharedAuthToken

scenarios:
  - name: dynamic PSU calls for each patient
  
    flow:
      - function: initUser

      # for each prescription (number of prescriptions is variable)
      - loop:
          - post:
              url: "/prescription-status-update/"
              beforeRequest: "generatePrescData"
              headers:
                Authorization: "Bearer {{ authToken }}"
                x-request-id:     "{{ x_request_id }}"
                x-correlation-id: "{{ x_correlation_id }}"
              expect:
                - statusCode: 201
          - think: "{{ nextDelay }}seconds"
        count: "{{ prescriptionCount }}"