artillery/notify_load_test.yml
config:
  processor: "./notify_entrypoint.mjs"
  phases:
    - name: ramp-up
      duration: "10m"
      arrivalRate: 20
      rampTo: 100
      maxVusers: 1000
    - name: steady-state
      duration: "30m"
      arrivalRate: 100
      maxVusers: 1000
  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk
    ref:
      target: https://ref.api.service.nhs.uk
    int:
      target: https://int.api.service.nhs.uk
    pr:
      target: https://psu-pr-{{ prNumber }}.dev.eps.national.nhs.uk
  defaults:
    headers:
      Authorization: "Bearer {{ authToken }}"

scenarios:
  - name: dynamic PSU calls for each patient
  
    # grab token once per VU
    before:
      - function: getSharedAuthToken

    flow:
      - function: initUser

      # for each prescription (number of prescriptions is variable)
      - loop:
          count: "{{ prescriptionCount }}"
          steps:
            - beforeRequest: generatePrescData

            - post:
                url: "/prescription-status-update/"
                headers:
                  x-request-id:     "{{ x_request_id }}"
                  x-correlation-id: "{{ x_correlation_id }}"
                expect:
                  - statusCode: 201

            # wait before next prescription
            - think: "{{ nextDelay }}"