artillery/psu_load_test.yml
config:
  processor: "./helper.mjs"
  plugins:
    expect: {}
    apdex: {}
  phases:
    - duration: 10
      arrivalRate: 1
      maxVusers: 2
      name: running phase
  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk/
    ref:
      target: https://ref.api.service.nhs.uk/
scenarios:
  - name: "call psu"
    beforeRequest: "getPSUParams"
    flow:
      - loop:
          - post:
              url: "/prescription-status-update/"
              headers:
                Authorization: "Bearer {{ authToken }}"
                x-request-id: "{{ x_request_id }}"
                x-correlation-id: "{{ x_correlation_id }}"
              expect:
                - statusCode: 201
          - think: 30
        count: 10